## Pandas Serisi Oluşturmak

In [1]:
import pandas

In [3]:
seri = pandas.Series([42, 34, 25, 38])

In [4]:
seri

0    42
1    34
2    25
3    38
dtype: int64

In [5]:
type(seri)

pandas.core.series.Series

In [10]:
seri.axes

[RangeIndex(start=0, stop=4, step=1)]

In [11]:
seri.dtype

dtype('int64')

In [12]:
seri.size

4

In [13]:
seri.ndim

1

In [14]:
seri.values

array([42, 34, 25, 38])

In [15]:
seri.head(2)

0    42
1    34
dtype: int64

In [19]:
seri.tail(2)

2    25
3    38
dtype: int64

In [20]:
#index isimlendirme

In [21]:
seri_2 = pandas.Series([54, 45, 34, 87, 56], index=[1, 3, 5, 7, 9])

In [22]:
seri_2

1    54
3    45
5    34
7    87
9    56
dtype: int64

In [24]:
seri_3 = pandas.Series([54, 45, 34, 87, 56], index=['a', 'b', 'c', 'd', 'e'])

In [25]:
seri_3

a    54
b    45
c    34
d    87
e    56
dtype: int64

In [26]:
seri_3['a']

54

In [27]:
seri_3['a': 'c']

a    54
b    45
c    34
dtype: int64

In [28]:
#sözlük üzerinden veri oluşturma

In [29]:
sozluk = {'log': 10, 'cart': 11}

In [30]:
seri_4 = pandas.Series(sozluk)

In [31]:
seri_4

log     10
cart    11
dtype: int64

In [32]:
#iki seriyi birleştirme

In [34]:
pandas.concat([seri, seri_2])

0    42
1    34
2    25
3    38
1    54
3    45
5    34
7    87
9    56
dtype: int64

## Eleman İşlemleri

In [5]:
import numpy

In [36]:
array = numpy.array([1, 2, 3, 4, 5])

In [37]:
seri_5 = pandas.Series(array)

In [38]:
seri_5

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [39]:
seri_5[0]

1

In [41]:
seri_5[1:3]

1    2
2    3
dtype: int64

In [42]:
seri_5.index

RangeIndex(start=0, stop=5, step=1)

In [43]:
seri_5.keys

<bound method Series.keys of 0    1
1    2
2    3
3    4
4    5
dtype: int64>

In [46]:
list(seri_5.items())

[(0, 1), (1, 2), (2, 3), (3, 4), (4, 5)]

In [47]:
0 in seri_5

True

In [48]:
6 in seri_5

False

## Pandas DataFrame Oluşturma

In [2]:
l = [1, 34, 54, 76]

In [3]:
l

[1, 34, 54, 76]

In [4]:
pandas.DataFrame(l, columns=['degisken_ismi'])

   degisken_ismi
0              1
1             34
2             54
3             76

In [6]:
mat = numpy.arange(1,10).reshape((3, 3))

In [7]:
pandas.DataFrame(mat, columns=['var1', 'var2', 'var3'])

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [8]:
#dataframe isimlendirme

In [9]:
df = pandas.DataFrame(mat, columns=['var1', 'var2', 'var3'])

In [10]:
df.head()

   var1  var2  var3
0     1     2     3
1     4     5     6
2     7     8     9

In [12]:
df.columns

Index(['var1', 'var2', 'var3'], dtype='object')

In [13]:
df.columns = ['deg1', 'deg2', 'deg3']

In [14]:
df

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

In [15]:
type(df)

pandas.core.frame.DataFrame

In [16]:
df.axes

[RangeIndex(start=0, stop=3, step=1),
 Index(['deg1', 'deg2', 'deg3'], dtype='object')]

In [17]:
df.shape

(3, 3)

In [18]:
df.ndim

2

In [19]:
df.size

9

In [21]:
df.values

array([[1, 2, 3],
       [4, 5, 6],
       [7, 8, 9]])

In [22]:
type(df.values)

numpy.ndarray

In [24]:
df.tail()

   deg1  deg2  deg3
0     1     2     3
1     4     5     6
2     7     8     9

## Eleman İşlemleri

In [26]:
s1 = numpy.random.randint(10, size=5)
s2 = numpy.random.randint(10, size=5)
s3 = numpy.random.randint(10, size=5)

In [27]:
sozluk = {'var1': s1, 'var2': s2, 'var3': s3}

In [28]:
sozluk

{'var1': array([0, 1, 9, 3, 0]),
 'var2': array([9, 0, 1, 0, 7]),
 'var3': array([0, 7, 1, 8, 6])}

In [29]:
df_2 = pandas.DataFrame(sozluk)

In [31]:
df_2

   var1  var2  var3
0     0     9     0
1     1     0     7
2     9     1     1
3     3     0     8
4     0     7     6

In [32]:
df_2[0:1]

   var1  var2  var3
0     0     9     0

In [34]:
df_2.index

RangeIndex(start=0, stop=5, step=1)

In [35]:
df_2.index = ['a', 'b', 'c', 'd', 'e']

In [36]:
df_2

   var1  var2  var3
a     0     9     0
b     1     0     7
c     9     1     1
d     3     0     8
e     0     7     6

In [37]:
df_2['c': 'e']

   var1  var2  var3
c     9     1     1
d     3     0     8
e     0     7     6

In [38]:
#silme

In [39]:
df_2.drop('a', axis = 0)

   var1  var2  var3
b     1     0     7
c     9     1     1
d     3     0     8
e     0     7     6

In [40]:
df_2

   var1  var2  var3
a     0     9     0
b     1     0     7
c     9     1     1
d     3     0     8
e     0     7     6

In [41]:
df_2.drop('a', axis = 0, inplace=True)

In [42]:
df_2

   var1  var2  var3
b     1     0     7
c     9     1     1
d     3     0     8
e     0     7     6

In [45]:
df_2['var4'] = df_2['var1'] * df_2['var2']

In [46]:
df_2

   var1  var2  var3  var4
b     1     0     7     0
c     9     1     1     9
d     3     0     8     0
e     0     7     6     0

In [47]:
#değişken silmek

In [49]:
df_2.drop('var4', axis = 1)

   var1  var2  var3
b     1     0     7
c     9     1     1
d     3     0     8
e     0     7     6